###############################################################
#  Generated by:      Cadence Innovus 20.15-s105_1
#  OS:                Linux x86_64(Host ID ee06)
#  Generated on:      Thu Dec 29 20:16:26 2022
#  Design:            CHIP
#  Command:           routeDesign -globalDetail -viaOpt -wireOpt
###############################################################
current_design CHIP
create_clock [get_ports {clk2}]  -name clk2 -period 20.000000 -waveform {0.000000 10.000000}
create_clock [get_ports {clk}]  -name clk -period 20.000000 -waveform {0.000000 10.000000}
set_propagated_clock  [get_ports {clk2}]
set_propagated_clock  [get_ports {clk}]
set_load -pin_load -max  0.05  [get_ports {out_valid}]
set_load -pin_load -min  0.05  [get_ports {out_valid}]
set_load -pin_load -max  0.05  [get_ports {out_data[31]}]
set_load -pin_load -min  0.05  [get_ports {out_data[31]}]
set_load -pin_load -max  0.05  [get_ports {out_data[30]}]
set_load -pin_load -min  0.05  [get_ports {out_data[30]}]
set_load -pin_load -max  0.05  [get_ports {out_data[29]}]
set_load -pin_load -min  0.05  [get_ports {out_data[29]}]
set_load -pin_load -max  0.05  [get_ports {out_data[28]}]
set_load -pin_load -min  0.05  [get_ports {out_data[28]}]
set_load -pin_load -max  0.05  [get_ports {out_data[27]}]
set_load -pin_load -min  0.05  [get_ports {out_data[27]}]
set_load -pin_load -max  0.05  [get_ports {out_data[26]}]
set_load -pin_load -min  0.05  [get_ports {out_data[26]}]
set_load -pin_load -max  0.05  [get_ports {out_data[25]}]
set_load -pin_load -min  0.05  [get_ports {out_data[25]}]
set_load -pin_load -max  0.05  [get_ports {out_data[24]}]
set_load -pin_load -min  0.05  [get_ports {out_data[24]}]
set_load -pin_load -max  0.05  [get_ports {out_data[23]}]
set_load -pin_load -min  0.05  [get_ports {out_data[23]}]
set_load -pin_load -max  0.05  [get_ports {out_data[22]}]
set_load -pin_load -min  0.05  [get_ports {out_data[22]}]
set_load -pin_load -max  0.05  [get_ports {out_data[21]}]
set_load -pin_load -min  0.05  [get_ports {out_data[21]}]
set_load -pin_load -max  0.05  [get_ports {out_data[20]}]
set_load -pin_load -min  0.05  [get_ports {out_data[20]}]
set_load -pin_load -max  0.05  [get_ports {out_data[19]}]
set_load -pin_load -min  0.05  [get_ports {out_data[19]}]
set_load -pin_load -max  0.05  [get_ports {out_data[18]}]
set_load -pin_load -min  0.05  [get_ports {out_data[18]}]
set_load -pin_load -max  0.05  [get_ports {out_data[17]}]
set_load -pin_load -min  0.05  [get_ports {out_data[17]}]
set_load -pin_load -max  0.05  [get_ports {out_data[16]}]
set_load -pin_load -min  0.05  [get_ports {out_data[16]}]
set_load -pin_load -max  0.05  [get_ports {out_data[15]}]
set_load -pin_load -min  0.05  [get_ports {out_data[15]}]
set_load -pin_load -max  0.05  [get_ports {out_data[14]}]
set_load -pin_load -min  0.05  [get_ports {out_data[14]}]
set_load -pin_load -max  0.05  [get_ports {out_data[13]}]
set_load -pin_load -min  0.05  [get_ports {out_data[13]}]
set_load -pin_load -max  0.05  [get_ports {out_data[12]}]
set_load -pin_load -min  0.05  [get_ports {out_data[12]}]
set_load -pin_load -max  0.05  [get_ports {out_data[11]}]
set_load -pin_load -min  0.05  [get_ports {out_data[11]}]
set_load -pin_load -max  0.05  [get_ports {out_data[10]}]
set_load -pin_load -min  0.05  [get_ports {out_data[10]}]
set_load -pin_load -max  0.05  [get_ports {out_data[9]}]
set_load -pin_load -min  0.05  [get_ports {out_data[9]}]
set_load -pin_load -max  0.05  [get_ports {out_data[8]}]
set_load -pin_load -min  0.05  [get_ports {out_data[8]}]
set_load -pin_load -max  0.05  [get_ports {out_data[7]}]
set_load -pin_load -min  0.05  [get_ports {out_data[7]}]
set_load -pin_load -max  0.05  [get_ports {out_data[6]}]
set_load -pin_load -min  0.05  [get_ports {out_data[6]}]
set_load -pin_load -max  0.05  [get_ports {out_data[5]}]
set_load -pin_load -min  0.05  [get_ports {out_data[5]}]
set_load -pin_load -max  0.05  [get_ports {out_data[4]}]
set_load -pin_load -min  0.05  [get_ports {out_data[4]}]
set_load -pin_load -max  0.05  [get_ports {out_data[3]}]
set_load -pin_load -min  0.05  [get_ports {out_data[3]}]
set_load -pin_load -max  0.05  [get_ports {out_data[2]}]
set_load -pin_load -min  0.05  [get_ports {out_data[2]}]
set_load -pin_load -max  0.05  [get_ports {out_data[1]}]
set_load -pin_load -min  0.05  [get_ports {out_data[1]}]
set_load -pin_load -max  0.05  [get_ports {out_data[0]}]
set_load -pin_load -min  0.05  [get_ports {out_data[0]}]
set_wire_load_mode top
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {in_valid}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[30]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[23]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[16]}]
set_input_delay -add_delay 0 -clock [get_clocks {clk}] [get_ports {rst_n}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[21]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[14]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {se_data[6]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {op_valid}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[12]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {se_data[4]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[10]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {se_data[2]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {se_data[0]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {op[2]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[28]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {op[0]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[26]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[19]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[31]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[24]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[17]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[22]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[15]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {se_data[7]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[20]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[13]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {se_data[5]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[11]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {se_data[3]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {se_data[1]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[29]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {op[1]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[27]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[25]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {pic_data[18]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[25]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[18]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[30]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[23]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[16]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[21]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[14]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[12]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[10]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[28]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[26]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[19]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[31]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[24]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[17]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_valid}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[22]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[15]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[20]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[13]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[11]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[29]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_data[27]}]
